Revit 2027 API
View.AssociatedAssemblyInstanceId Property
 The Id of the assembly instance that owns the assembly view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId AssociatedAssemblyInstanceId { get; }
Public ReadOnly Property AssociatedAssemblyInstanceId As ElementId
	Get
public:
property ElementId^ AssociatedAssemblyInstanceId {
	ElementId^ get ();
}
member AssociatedAssemblyInstanceId : ElementId with get
Property Value
ElementId
See Also
Reference
View Class
Autodesk.Revit.DB Namespace